package BitManupulation;

public class basics {
    public static void main(String[] args) {
        // AND

        // 1 & 1 = 1

        // 1 & 0 = 0

        // 0 & 1 = 0

        // 0 & 0 = 0
        // --------------------------------------
        // 5 = 0101

        // 6 = 0110

        // -----------

        // 0100

        // = 4
        System.out.println(5 & 6);

        // OR (|)
        // 1 | 1 = 1

        // 1 | 0 = 1

        // 0 | 1 = 1

        // 0 | 0 = 0

        // --------------------------------------
        // Example

        // 5 = 0101

        // 6 = 0110

        // -----------

        // 0111

        // = 7
        System.out.println(5 | 6);

        // --------------------------------------

        // XOR (^)
        // Rule

        // 1 ^ 1 = 0

        // 1 ^ 0 = 1

        // 0 ^ 1 = 1

        // 0 ^ 0 = 0

        // Example

        // 5 = 0101

        // 6 = 0110

        // -----------

        // 0011

        // = 3
        System.out.println(5 ^ 6);
        // --------------------------------------


//         NOT (~)

// Flips every bit.

// Example

// 5

// 00000101

// ↓

// 11111010

System.out.println(~6); //-6 i,e 
// Why?

// Formula

// ~n = -(n+1)

// Example

// ~5

// = -(5+1)

// = -6

// Remember this formula.
      
        // ----------------------------------------------------------------------------

// Left Shift (<<)

// Moves bits to left.

// Formula

// n << i

// =

// n × 2ⁱ

// Example

// 5 << 1
// 5 × 2¹

// =

// 10

// Example

// 5 << 2
// 5 × 2²

// =

// 20
System.out.println(5<<2);
  // ----------------------------------------------------------------------------
// Right Shift (>>)

// Moves bits to right.

// Formula

// n >> i

// =

// n / 2ⁱ

// Example

// 20 >> 2
// 20 / 4

// =

// 5

System.out.println(20>>2);
// Summary
// Operator	Formula
// n<<i	n × 2ⁱ
// n>>i	n ÷ 2ⁱ

  // ----------------------------------------------------------------------------
// Day-2


    }
}
